<?php
// +----------------------------------------------------------------------
// | Author ：Naofbear
// +----------------------------------------------------------------------
// | Email : huakaiquan@qq.com
// +----------------------------------------------------------------------

return [
    //是否启用中间件功能,禁用所有中间件都将停止使用
    'enable_middleware'=>true,
    
    //是否开启Debug错误调试
    'debug'=>true,

    //默认控制器
    'default_controller'=>'Index',
    
    //默认方法
    'default_action'=>'home',
    
    //是否自动载入模板
    'autoload_template'=>false,
];